cf_billing/Documents/энргЗакрытиеПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргЗакрытиеПериода</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргЗакрытиеПериода</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргЗакрытиеПериода/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли; 	
	
	ГраницыПериода  			= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата 					= ГраницыПериода.ЗавершениеОП -1;
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ГраницыПериода", ГраницыПериода);
	
	Ответственный 				= Пользователи.ТекущийПользователь();
			
	Инструменты  				= энргФабрикаИнструментовНачисления.РаботаСПериодомДействия();			
	Если Инструменты = Неопределено тогда 		
		Отказ 					= истина;
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	РезультатПоследовательность = Инструменты.ПоследовательностьНарушена(ПериодНачисления,Район);
	ПоследовательностьНарушена 	= НЕ РезультатПоследовательность.Пустой();

	Если ПоследовательностьНарушена Тогда
		Отказ 					= истина;
		Выборка  				= РезультатПоследовательность.Выбрать();
		ТекстОшибки 			= "Не выполнены следующие операции:
		|";
		Пока Выборка.Следующий() Цикл
			ТекстОшибки = ТекстОшибки + Выборка.ВидОперации + Символы.ПС;
		КонецЦикла;		
		ТекстОшибки 			= ТекстОшибки + "закрытие периоды не выполнено";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
